implement-verify-service/test-results/java-repo/pipeline-output/java-design-patterns/test/diagrams/class-diagram.mmd
classDiagram
    class AbstractDocument {
        +AbstractDocument(Map<String, Object> properties)
        +buildStringRepresentation()
        +children(String key, Function<Map<String, Object>, T> childConstructor)
        +documentProperties
        +get(String key)
        +put(String key, Object value)
        +toString()
    }
    class App {
        +main(String[] args)
        +createKingdom(final Kingdom.FactoryMaker.KingdomType kingdomType)
        +kingdom
        +main(String[] args)
        +run()
        +NUM_CREATURES
        +logger
        +main(String[] args)
        +run()
        +main(String[] args)
        +main(String[] args)
    }
    class Car {
        +Car(Map<String, Object> properties)
    }
    class Part {
        +Part(Map<String, Object> properties)
    }
    class Property {
    }
    class AbstractDocumentTest {
        +KEY
        +VALUE
        +document
        +shouldHandleExceptionDuringConstruction()
        +shouldIncludePropsInToString()
        +shouldPutAndGetNestedDocument()
        +shouldPutAndGetValue()
        +shouldRetrieveChildren()
        +shouldRetrieveEmptyStreamForNonExistingChildren()
        +shouldUpdateExistingValue()
    }
    class DocumentImplementation {
    }
    class AppTest {
        +shouldExecuteAppWithoutException()
        +shouldExecuteApplicationWithoutException()
        +shouldExecuteApplicationWithoutException()
    }
    class DomainTest {
        +TEST_CAR_MODEL
        +TEST_CAR_PRICE
        +TEST_PART_MODEL
        +TEST_PART_PRICE
        +TEST_PART_TYPE
        +shouldConstructCar()
        +shouldConstructPart()
    }
    class ElfArmy {
        +DESCRIPTION
        +getDescription()
    }
    class ElfCastle {
        +DESCRIPTION
        +getDescription()
    }
    class ElfKing {
        +DESCRIPTION
        +getDescription()
    }
    class ElfKingdomFactory {
        +createArmy()
        +createCastle()
        +createKing()
    }
    class FactoryMaker {
    }
    class Kingdom {
        +army
        +castle
        +king
    }
    class KingdomType {
    }
    class OrcArmy {
        +DESCRIPTION
        +getDescription()
    }
    class OrcCastle {
        +DESCRIPTION
        +getDescription()
    }
    class OrcKing {
        +DESCRIPTION
        +getDescription()
    }
    class OrcKingdomFactory {
        +createArmy()
        +createCastle()
        +createKing()
    }
    class AbstractFactoryTest {
        +app
        +verifyArmyCreation()
        +verifyCastleCreation()
        +verifyElfKingdomCreation()
        +verifyKingCreation()
        +verifyOrcKingdomCreation()
    }
    class ActiveCreature {
        +ActiveCreature(String name)
        +eat()
        +getStatus()
        +kill(int status)
        +logger
        +name
        +name()
        +requests
        +roam()
        +status
        +thread
    }
    class Orc {
        +Orc(String name)
    }
    class ActiveCreatureTest {
        +executionTest()
    }
    class Actor {
        +active
        +actorId
        +mailbox
        +onReceive(Message message)
        +run()
        +send(Message message)
        +stop()
    }
    class ActorSystem {
        +actorRegister
        +executor
        +getActorById(String actorId)
        +idCounter
        +shutdown()
        +startActor(Actor actor)
    }
    class ExampleActor {
        +ExampleActor(ActorSystem actorSystem)
        +actorSystem
        +onReceive(Message message)
        +receivedMessages
    }
    class ExampleActor2 {
        +ExampleActor2(ActorSystem actorSystem)
        +actorSystem
        +onReceive(Message message)
        +receivedMessages
    }
    class Message {
        +content
        +senderId
    }
    class ActorModelTest {
        +testMainMethod()
        +testMessagePassing()
    }
    class ConfigureForDosVisitor {
        +visit(Hayes hayes)
        +visit(Zoom zoom)
    }
    class ConfigureForUnixVisitor {
        +visit(Zoom zoom)
    }
    class Hayes {
        +accept(ModemVisitor modemVisitor)
        +toString()
    }
    class Zoom {
        +accept(ModemVisitor modemVisitor)
        +toString()
    }
    class Document {
    }
    class HasModel {
    }
    class HasPrice {
    }
    class HasParts {
    }
    class HasType {
    }
    class Runnable {
    }
    class Army {
    }
    class Castle {
    }
    class King {
    }
    class KingdomFactory {
    }
    class AllModemVisitor {
    }
    class ZoomVisitor {
    }
    class HayesVisitor {
    }
    class Modem {
    }
    class ModemVisitor {
    }
    Document <|-- AbstractDocument
    AbstractDocument <|-- Car
    HasModel <|-- Car
    HasPrice <|-- Car
    HasParts <|-- Car
    Document <|-- HasModel
    Document <|-- HasParts
    Document <|-- HasPrice
    Document <|-- HasType
    AbstractDocument <|-- Part
    HasType <|-- Part
    HasModel <|-- Part
    HasPrice <|-- Part
    AbstractDocument <|-- DocumentImplementation
    Runnable <|-- App
    Army <|-- ElfArmy
    Castle <|-- ElfCastle
    King <|-- ElfKing
    KingdomFactory <|-- ElfKingdomFactory
    Army <|-- OrcArmy
    Castle <|-- OrcCastle
    King <|-- OrcKing
    KingdomFactory <|-- OrcKingdomFactory
    Runnable <|-- App
    ActiveCreature <|-- Orc
    Runnable <|-- Actor
    Actor <|-- ExampleActor
    Actor <|-- ExampleActor2
    ZoomVisitor <|-- AllModemVisitor
    HayesVisitor <|-- AllModemVisitor
    AllModemVisitor <|-- ConfigureForDosVisitor
    ZoomVisitor <|-- ConfigureForUnixVisitor
    Modem <|-- Hayes
    ModemVisitor <|-- HayesVisitor
    Modem <|-- Zoom
